<template>
  <main-layout>
    <base-page-header :has-back-btn="true">
      {{ $t('about') }}
    </base-page-header>
    <base-page-body>

      <div class="card mt-2">
        <div class="card-header">Quote</div>
        <div class="card-body">
          <blockquote class="blockquote mb-0">
            <p>Немає нічого важливішого для християнина, ніж щоденно споживати чисте словесне молоко.</p>
            <footer class="blockquote-footer">Someone in <cite title="Source Title">UBF</cite></footer>
          </blockquote>
        </div>
      </div>
      <div class="card mt-2">
        <div class="card-header">About the project</div>
        <div class="card-body">
          <p>Проект був створений для допомоги у щоденному читанні
            Божого Слова. Немає нічого важливішого для християнина, ніж щоденно споживати чисте словесне молоко. Тепер Ви
            можете щоранку (чи в будь-який зручний час) зайти на наш сайт зі свого комп'ютера, КПК чи мобільного телефону
            і читати слово Бога, і розмірковувати над ним.</p>
          <p>Наші тексти - не вичерпний коментар на місце Писання, а скоріше поштовх, щоб Ви самостійно розмірковували над
            словом Бога і отримали благодать в особистому спілкуванні з Ним (читайте <a href="#suggestions">"Поради до
              написання духовного хліба"</a>).</p>
          <p>Проект підтримують брати і сестри з <a href="https://ubf.org.ua" target="_blank">Університетської Біблійної
            Співдружності, м.Київ</a>.</p>

          <small>Якщо Ви зустріли в тексті опечатку чи помилку, повідомте нам, будь-ласка. Ми завжди готові покращити наші
            тексти.</small>
        </div>
      </div>
      <div class="card mt-2">
        <div class="card-header" id="suggestions">Tips for writing spiritual bread</div>
        <div class="card-body">
          <ol class="j">
            <li>Молитва. Перед тим, як перейти до читання слова Бога, помоліться, щоб підготувати себе сприйняти те, що
              ви будете читати: <i>„Відверни мої очі, щоб марноти не бачили, на дорозі Своїй оживи Ти мене!”</i>
              (Пс.118:37)
            </li>
            <li>Читання. Про що йдеться в цьому уривку? Зверніть особливу увагу на описані в ньому події щоб краще
              зрозуміти про що говорить слово Бога.
            </li>
            <li>Аналіз. Що це означає? Що хотів передати автор через ці слова? Особливо відмітьте:
              <ol type="a">
                <li>те, що написано про Бога Батька, Його єдиного Сина Ісуса Христа та про Святого Духа;
                </li>
                <li>те, що потрібно виконувати в християнському житті:
                </li>
                <li>чи є обіцянки, на які ми можемо надіятись?
                </li>
                <li>чи є вказівки, яким треба підкорятись?
                </li>
                <li>чи є застереження, на які варто звернути увагу?
                </li>
                <li>чи є у вас звички, які треба змінити?
                </li>
                <li>чи є гріхи, яких треба уникати?
                </li>
                <li>яке вчення є найбільш важливим в цьому уривку?
                </li>
                <li>який вірш є ключовим?
                </li>
              </ol>
            </li>
            <li>Написання. Знайдіть ключовий вірш та найважливіше вчення і спробуйте написати їх. Напишіть як це вчення
              можна застосувати в вашому житті.
            </li>
            <li>Заключна молитва. Закінчіть вивчення слова написанням вашої особистої молитви, основаної на даному
              уривку.
            </li>
          </ol>
        </div>
      </div>

    </base-page-body>
  </main-layout>
</template>

<script>
import MainLayout from '@/views/layouts/MainLayout'
import BasePageHeader from '@/components/base/page/BasePageHeader'
import BasePageBody from '@/components/base/page/BasePageBody'

export default {
  name: 'AboutVIew',
  components: { BasePageBody, BasePageHeader, MainLayout }
}
</script>

<style scoped>

</style>
