<template>
  <main-layout>
    <base-page-header :has-back-btn="true">
      {{ $t('About') }}
    </base-page-header>
    <base-page-body>

      <div class="card mt-2">
        <div class="card-header">{{ $t('Quote') }}</div>
        <div class="card-body">
          <blockquote class="blockquote mb-0">
            <p>{{ $t('QuoteText') }}</p>
            <footer class="blockquote-footer">{{ $t('Someone in') }} <cite title="Source Title">UBF</cite></footer>
          </blockquote>
        </div>
      </div>
      <div class="card mt-2">
        <div class="card-header">{{ $t('About the project') }}</div>
        <div class="card-body" v-if="lang === 'ru'">
          <p>Проект создавался как помощь в чтении Слова Бога на каждый день. Нет ничего важнее для христианина, чем
            питаться чистым словесным молоком ежедневно. Теперь Вы можете каждое утро (или в любое удобное время) зайти
            на наш сайт со своего компьютера, КПК или мобильного телефона и читать слово Бога, и размышлять над ним.</p>
          <p>Наши тексты - не исчерпывающий комментарий на место Писания, а скорее толчок, чтобы Вы сами размышляли над
            словом Бога и получили благодать в личном общении с Ним (читайте <a href="#suggestions">"Введение к написанию духовного хлеба"</a>).
          </p>
          <p>Проект поддерживается братьями и сестрами из <a href="https://ubf.org.ua" target="_blank">Университетского Библейского Содружества</a>, г.Киев.</p>

          <small>Если Вы встретили в тексте опечатку или ошибку, сообщите нам, пожалуйста. Мы всегда готовы делать наши тексты
            лучше.</small>
        </div>
        <div class="card-body" v-else>
          <p>Проект був створений для допомоги у щоденному читанні
            Божого Слова. Немає нічого важливішого для християнина, ніж щоденно споживати чисте словесне молоко. Тепер
            Ви
            можете щоранку (чи в будь-який зручний час) зайти на наш сайт зі свого комп'ютера, КПК чи мобільного
            телефону
            і читати слово Бога, і розмірковувати над ним.</p>
          <p>Наші тексти - не вичерпний коментар на місце Писання, а скоріше поштовх, щоб Ви самостійно розмірковували
            над
            словом Бога і отримали благодать в особистому спілкуванні з Ним (читайте <a href="#suggestions">"Поради до
              написання духовного хліба"</a>).</p>
          <p>Проект підтримують брати і сестри з <a href="https://ubf.org.ua" target="_blank">Університетської Біблійної
            Співдружності, м.Київ</a>.</p>

          <small>Якщо Ви зустріли в тексті опечатку чи помилку, повідомте нам, будь-ласка. Ми завжди готові покращити
            наші
            тексти.</small>
        </div>
      </div>
      <div class="card mt-2">
        <div class="card-header" id="suggestions">{{ $t('Tips for writing spiritual bread') }}</div>
        <div class="card-body" v-if="lang === 'ru'">
          <ol class="j">
            <li>Молитва. Перед тем, как приступить к чтению Слова Бога, помолитесь, чтобы подготовить себя воспринять
              то, что вы будете читать: <i>"Отврати очи мои, чтобы не видеть суеты; животвори меня на пути Твоем"</i>
              (Пс.118:37)
            </li>
            <li> Чтение. О чем говорится в данном отрывке? Обратите особое внимание на описанные в нем события, чтобы
              глубже понять истинный смысл Слова Бога.
            </li>
            <li> Размышление. Что это означает? Что хотел передать автор через эти слова? Особо отметьте:
              <ol type="a">
                <li> то, что написано о Боге-Отце, Его единственном Сыне Иисусе и о Святом Духе;
                </li>
                <li> то, чему нужно следовать в христианской жизни:
                  <ul>
                    <li> Есть ли обещания, на которые мы можем уповать?
                    </li>
                    <li> Есть ли указания, которым нужно повиноваться?
                    </li>
                    <li> Имеются ли предостережения, на которые следует обратить внимание?
                    </li>
                    <li> Есть ли у вас привычки, которые нужно изменить? Есть ли грехи, которых нужно избегать?
                    </li>
                  </ul>
                </li>
                <li> Какое наставление является наиболее важным в этом отрывке? Какой стих является ключевым?
                </li>
              </ol>
            </li>
            <li> Написание. Найдите ключевой стих и наиболее важное наставление и попробуйте написать о них. Напишите,
              как эти наставления можно применить в вашей жизни.
            </li>
            <li> Заключительная молитва. Закончите изучение слова написанием вашей личной молитвы, основанной на данном
              отрывке.
            </li>
          </ol>
        </div>
        <div class="card-body" v-else>
          <ol class="j">
            <li>Молитва. Перед тим, як перейти до читання слова Бога, помоліться, щоб підготувати себе сприйняти те, що
              ви будете читати: <i>„Відверни мої очі, щоб марноти не бачили, на дорозі Своїй оживи Ти мене!”</i>
              (Пс.118:37)
            </li>
            <li>Читання. Про що йдеться в цьому уривку? Зверніть особливу увагу на описані в ньому події щоб краще
              зрозуміти про що говорить слово Бога.
            </li>
            <li>Аналіз. Що це означає? Що хотів передати автор через ці слова? Особливо відмітьте:
              <ol type="a">
                <li>те, що написано про Бога Батька, Його єдиного Сина Ісуса Христа та про Святого Духа;
                </li>
                <li>те, що потрібно виконувати в християнському житті:
                </li>
                <li>чи є обіцянки, на які ми можемо надіятись?
                </li>
                <li>чи є вказівки, яким треба підкорятись?
                </li>
                <li>чи є застереження, на які варто звернути увагу?
                </li>
                <li>чи є у вас звички, які треба змінити?
                </li>
                <li>чи є гріхи, яких треба уникати?
                </li>
                <li>яке вчення є найбільш важливим в цьому уривку?
                </li>
                <li>який вірш є ключовим?
                </li>
              </ol>
            </li>
            <li>Написання. Знайдіть ключовий вірш та найважливіше вчення і спробуйте написати їх. Напишіть як це вчення
              можна застосувати в вашому житті.
            </li>
            <li>Заключна молитва. Закінчіть вивчення слова написанням вашої особистої молитви, основаної на даному
              уривку.
            </li>
          </ol>
        </div>
      </div>

    </base-page-body>
  </main-layout>
</template>

<script>
import MainLayout from '@/views/layouts/MainLayout'
import BasePageHeader from '@/components/base/page/BasePageHeader'
import BasePageBody from '@/components/base/page/BasePageBody'

export default {
  name: 'AboutVIew',
  components: { BasePageBody, BasePageHeader, MainLayout },
  computed: {
    lang () {
      return this.$store.getters.getUILangCode
    }
  }
}
</script>

<style scoped>

</style>
